In [6]:
import pandas as pd

In [7]:
exeam_data={'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}
df=pd.DataFrame(exeam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [14]:
#'수학' 점수 데이터에 선택, 변수math에 저장
mth1=df['수학']
mth1

0    90
1    80
2    70
Name: 수학, dtype: int64

In [13]:
#'영어' 점수 데이터에 선택, 변수emglish에 저장
eglish=df['영어']
eglish

0    98
1    89
2    95
Name: 영어, dtype: int64

In [16]:
#'음악','체육' 점수 데이터에 선택, 변수sere1에 저장
sere1=df[['음악','체육']]
sere1

    음악   체육
0   85  100
1   95   90
2  100   90

In [7]:
df.iloc[::2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90